In [30]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [31]:
animals = DataFrame(np.arange(16).reshape(4,4),
                   columns=['W','X','Y','Z'],
                   index=['Dog','Cat','Bird','Mouse'])

animals

        W   X   Y   Z
Dog     0   1   2   3
Cat     4   5   6   7
Bird    8   9  10  11
Mouse  12  13  14  15

In [32]:
#Use either integer location or label location w/iloc or loc since ix is deprecated
animals.iloc[1:2,[0,2]] = np.nan
#or
animals.loc[['Cat'],['W','Y']] = np.nan

In [33]:
animals

          W   X     Y   Z
Dog     0.0   1   2.0   3
Cat     NaN   5   NaN   7
Bird    8.0   9  10.0  11
Mouse  12.0  13  14.0  15

In [34]:
#Dictionary with behavior values
behavior_map = {'W':'good','X':'bad','Y':'good','Z':'bad'}

In [37]:
#behavior_map marked each of the columns with a value to group the rows by
animal_col = animals.groupby(behavior_map,axis=1)

animal_col.sum()

        bad  good
Dog     4.0   2.0
Cat    12.0   0.0
Bird   20.0  18.0
Mouse  28.0  26.0

In [38]:
behave_ser = Series(behavior_map)

behave_ser

W    good
X     bad
Y    good
Z     bad
dtype: object

In [39]:
#Using the series for groupby counting each instance of good/bad for animals
animals.groupby(behave_ser,axis=1).count()

       bad  good
Dog      2     2
Cat      2     0
Bird     2     2
Mouse    2     2

In [40]:
animals

          W   X     Y   Z
Dog     0.0   1   2.0   3
Cat     NaN   5   NaN   7
Bird    8.0   9  10.0  11
Mouse  12.0  13  14.0  15

In [41]:
#Groupby length of animals names
animals.groupby(len).sum()

      W   X     Y   Z
3   0.0   6   2.0  10
4   8.0   9  10.0  11
5  12.0  13  14.0  15

In [42]:
keys = ['A','B','A','B']

In [44]:
#pushes an index of keys onto the df, groupby the len then gets the max value from each
animals.groupby([len,keys]).max()

        W   X     Y   Z
3 A   0.0   1   2.0   3
  B   NaN   5   NaN   7
4 A   8.0   9  10.0  11
5 B  12.0  13  14.0  15

In [46]:
#Groupby with index hierarchy levels
hier_col = pd.MultiIndex.from_arrays([['NY','NY','NY','SF','SF'],[1,2,3,1,2]],names=['City','sub_value'])

In [47]:
#Create a df using the hierarchal index
dframe_hr = DataFrame(np.arange(25).reshape(5,5),columns=hier_col)

In [49]:
dframe_hr = dframe_hr * 100

In [50]:
dframe_hr

City         NY                SF
sub_value     1     2     3     1     2
0             0   100   200   300   400
1           500   600   700   800   900
2          1000  1100  1200  1300  1400
3          1500  1600  1700  1800  1900
4          2000  2100  2200  2300  2400

In [ ]:
#Can use multiindex from arrays to build hierarchal index for your dataframe